#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Есть значение радиуса круга
radius = 42
PI = 3.1415926


# Выведите на консоль значение площади этого круга с точностью до 4-х знаков после запятой
# подсказки:
#       формулу можно подсмотреть в интернете,
#       пи возьмите равным 3.1415926
#       точность указывается в функции round()
def circle_area(r):
    return round(PI * r ** 2, 4)


# Далее, пусть есть координаты точки
point_1 = (23, 34)
# где 23 - координата х, 34 - координата у


# Если точка point лежит внутри того самого круга [центр в начале координат (0, 0), radius = 42],
# то выведите на консоль True, Или False, если точка лежит вовне круга.
# подсказки:
#       нужно определить расстояние от этой точки до начала координат (0, 0)
#       формула так же есть в интернете
#       квадратный корень - это возведение в степень 0.5
#       операции сравнения дают булевы константы True и False
def is_inside(point, r):
    x, y = point
    radius_vector = ((0 - x) ** 2 + (0 - y) ** 2) ** 0.5  #данная нам формула
    return radius_vector < r


#аналогично для другой точки
point_2 = (30, 30)



def main():
    print(circle_area(radius))
    print(is_inside(point_1, radius))
    print(is_inside(point_2, radius))


if __name__ == '__main__':
    main()