#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Создайте списки:

# моя семья (минимум 3 элемента, есть еще дедушки и бабушки, если что)
my_family = ["мать", "отец", "брат"]

# список списков приблизительного роста членов вашей семьи
my_family_height = [
    ["мать", 165],
    ["отец", 168],
    ["брат", 169]
]

# Выведите на консоль рост отца в формате
#   Рост отца - ХХ см
print("Рост ", my_family[1], " - ", my_family_height[1][1])

# Выведите на консоль общий рост вашей семьи как сумму ростов всех членов
summ = 0
for name in range(len(my_family_height)):
    summ += my_family_height[name][1]
print(summ)


